/*******************************************************************************
* validator.defaults.js -  validator.defaults
* Copyright (C) 2013 
*
* @Author Skiny
* @Email lavenler@live.cn
* @UpdateTime (2013-10-05)
*******************************************************************************/



(function(window,undefined){
	if(validator){
		validator.defaults={
			rules:{
				integer:/^[1-9]\d*$/,
				number:/^\d*$/,
				numberNO:/^[1-9]([0-9])*$/,
				decimal:/^[0-9]+([.]{1}[0-9]+){0,1}$/,
				money:/^(([1-9]+\d*)|([1-9]+\d*\.\d{1,2}))$/,
				letters:/^[A-Za-z]+$/,
				chars:/^[A-Za-z0-9_]+$/,
				chinese:/^[\u4e00-\u9fa5]{0,}$/,
				email:/^[\w-]+(\.[\w-]+)*@[\w-]+(\.[\w-]+)+$/,
				telphone:/^(13|15|18|17)\d{9}$/,
				//座机和电话
				phonet:/^((0\d{2,3}-\d{7,8})|(1[3584]\d{9}))$/,
				// idcard:/(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/,
				idcard:/^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/,
				password:/^(?=.*[0-9].*)(?=.*[a-z].*).{6,20}$/,
				phone:/^((\d{7,8})|(\d{4}|\d{3})-(\d{7,8})|(\d{4}|\d{3})-(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1})|(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1}))$/,
				url:new RegExp("^(http|https|ftp)\://([a-zA-Z0-9\.\-]+(\:[a-zA-Z0-9\.&amp;%\$\-]+)*@)*((25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9])\.(25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9]|0)\.(25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9]|0)\.(25[0-5]|2[0-4][0-9]|[0-1]{1}[0-9]{2}|[1-9]{1}[0-9]{1}|[0-9])|localhost|([a-zA-Z0-9\-]+\.)*[a-zA-Z0-9\-]+\.(com|edu|gov|int|mil|net|org|biz|arpa|info|name|pro|aero|coop|museum|[a-zA-Z]{2}))(\:[0-9]+)*(/($|[a-zA-Z0-9\.\,\?\'\\\+&amp;%\$#\=~_\-]+))*$"),
				mon:/^((\d{1,8})|(\d{1,8}\.\d{1,2}))$/,
				chineseLetterNum:/^(?!\d)[\(\)（）a-zA-Z0-9_\u4e00-\u9fa5]*$/,
				postcode:/^[0-9]{6}$/


			},
			messages:{
				integer:"请输入正整数。",
				required:"此字段为必填项。",
				numberNO:"请输入非零整数",
				minLength:"至少需要输入【{minLength}】个字符，已输入【{inputlength}】个字符。",
				maxLength:"最多允许输入【{maxLength}】个字符，已输入【{inputlength}】个字符。",
				number:"请输入正整数。",
				decimal:"请输入整数或者小数。",
				money:"请输入金额，精确到小数点后两位。",
				letters:"请输入由字母(不区分大小写)组成的字符串。",
				chars:"请输入由字母(不区分大小写)、数字、下划线组成的字符串。",
				chinese:"请输入中文。",
				email:"请输入有效的电子邮箱地址。",
				telphone:"请输入有效的手机号码。",
				idcard:"请输入有效的身份证号码。",
				phone:"请输入有效的电话号码。",
				phonet:"请输入有效的电话号码。座机请加区号如028-",
				url:"请输入有效的网址。",
				authFunc:"自定义验证函数有错误，请检查。",
				password:"密码长度为6-20位，必须同时具备字母 和 数字。",
				mon:"请输入金额，整数位数最多8位，精确到小数点后两位。",
				chineseLetterNum:"只能输入汉字、字母、数字、下划线、括号，且不能以数字开头。",
				postcode:"请输入正确的邮编",
				chineseOrEnglish:"请输入中文或英文"
			}
		};
	}
})(window);